app/controllers/adminl_controller.rb

  def index
    @users=User.where(:admin => true,:sadmin =>false)
---
SELECT "users".* FROM "users" WHERE "users"."admin" = ? AND "users"."sadmin" = ?  [["admin", "t"], ["sadmin", "f"]]