app/controllers/cars_controller.rb

  def index
    @user=User.all
    @cars = Car.all
---
SELECT "cars".* FROM "cars"

  def show
    @orders = Order.where(:car_id => params[:id]).order("created_at ASC")
---
SELECT "orders".* FROM "orders" WHERE "orders"."car_id" = ? ORDER BY created_at ASC  [["car_id", 2]]

  def create
    @car = Car.new(car_params)
    @car.status = "available"

    if @car.price.nil?
      @car.price=0
    end

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Toyota"], ["description", "Corolla 2010"], ["image_url", ""], ["price", 100.0], ["created_at", "2017-09-16 21:37:19.579842"], ["updated_at", "2017-09-16 21:37:19.579842"]]

  def destroy
    respond_to do |format|
      if @car.destroy
---
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 2]]