app/controllers/line_items_controller.rb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "line_items" ("car_id", "reservation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["car_id", 2], ["reservation_id", 1], ["created_at", "2017-09-17 02:52:35.743388"], ["updated_at", "2017-09-17 02:52:35.743388"]]
---
  def create
    @resevation = current_reservation
    car = Car.find(params[:car_id])
    @line_item = @resevation.line_items.build(:car=>car)

    respond_to do |format|
      if @line_item.save