app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 14]]
---
  def index
    @orders = Order.all
    if logged_in?
      if current_user.admin?
        @orders = Order.all
      else
        #@orders=Order.where(:email => current_user.email)
        @orders=Order.where(:user_id => current_user.id)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new

    @order = Order.new

    if params.key?(:reservation_id)
      reservation = Reservation.find(params[:reservation_id])
      #reservation.status = 'checkout'
      @order.reservation_id = reservation.id
      @order.name = reservation.name
      @order.car_id = reservation.car_id
      @order.email = reservation.email
      @order.address = reservation.address
      #@order.return_time = reservation.return_time
      # @order.checkout_time = reservation.checkout_time ## should be written here but I move it into create,more info see create
      #view corresponding form should be read only
    else
      @@reservationid += 1
      @order.reservation_id = @@reservationid
      # @order.real_checkout_time = Time.now
      car = Car.find(params[:car_id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
INSERT INTO "orders" ("name", "address", "email", "created_at", "updated_at", "car_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "234"], ["address", "yyyyy"], ["email", "uuuu"], ["created_at", "2017-09-18 02:51:19.815148"], ["updated_at", "2017-09-18 02:51:19.815148"], ["car_id", 3]]
INSERT INTO "reservations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-09-17 15:56:41.962498"], ["updated_at", "2017-09-17 15:56:41.962498"]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "checkedout"], ["updated_at", "2017-10-01 18:20:27.368409"], ["id", 2]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "checkedout"], ["updated_at", "2017-10-01 18:20:27.376319"], ["id", 208]]
---
  def create

    @order = Order.new(order_params)
    car = Car.find(@order.car_id)
    @order.real_checkout_time = Time.now
    if @order.reservation_id < Order::CHECKOUT_DIRECT_START_NO
      reservation = Reservation.find(@order.reservation_id)
      @order.return_time = reservation.return_time
      @order.checkout_time = reservation.checkout_time # still dont know why should add this line as it should not be here, database refresh is slow may be the reason
    else
      @order.return_time = @order.checkout_time+Integer(order_params[:return_time]).hours
    end

    if current_user != nil # 有必要判断吗？
      @order.user_id = current_user.id
    end

    @order.status = 'checkedout'
    # @order = Order.new(order_params)
    # @order.add_line_items_from_reservation(current_reservation)
    #@order.name= '12345'
    #@order.name=reservation.name
    #@order.car_id=reservation.car_id
    #@order.address=reservation.address
    #@order.email=reservation.email
    #@order.status='checked out'
    #@order.real_checkout_time = Time.now
    #end

    respond_to do |format|
      if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "available"], ["updated_at", "2017-10-02 09:07:23.678561"], ["id", 7]]
UPDATE "orders" SET "name" = ?, "email" = ?, "real_checkout_time" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["name", "2222"], ["email", "2222"], ["real_checkout_time", "2017-10-03 17:52:00"], ["updated_at", "2017-10-03 17:52:23.140106"], ["id", 105]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "returned"], ["updated_at", "2017-10-02 09:07:23.683678"], ["id", 218]]
---
  def update
    @order = Order.find(params[:id])
    #@order.update_attribute('status','returned')
    #@order.update_attribute('real_return_time',Time.now)
    car = Car.find(@order.car_id)
    #car.update_attribute('status','available')
    if @order.reservation_id < Order::CHECKOUT_DIRECT_START_NO
      #reservation = Reservation.find(@order.reservation_id)
      #reservation.update_attribute('status','returned')
    end

    respond_to do |format|
      #if @order.save
      #if !format.nil?

      if @order.update(order_params)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 105], ["LIMIT", 1]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "available"], ["updated_at", "2017-10-03 17:52:32.929893"], ["id", 9]]
UPDATE "orders" SET "updated_at" = ?, "real_return_time" = ? WHERE "orders"."id" = ?  [["updated_at", "2017-10-03 17:52:32.921409"], ["real_return_time", "2017-10-03 17:52:32.919971"], ["id", 105]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 238], ["LIMIT", 1]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "returned"], ["updated_at", "2017-10-03 17:52:32.934155"], ["id", 238]]
---
  def return
    @order = Order.find(params[:id])
    car = Car.find(@order.car_id)
    @order.update_attribute('status', 'returned')
    @order.update_attribute('real_return_time', Time.now)
    car.update_attribute('status', 'available')


    #calculate the charge
    charge = ((@order.real_return_time-@order.real_checkout_time)/3600)*car.price
    @order.update_attribute('charge',charge)

    if @order.reservation_id < Order::CHECKOUT_DIRECT_START_NO
      reservation = Reservation.find(@order.reservation_id)
      reservation.update_attribute('status', 'returned')

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "available"], ["updated_at", "2017-10-02 00:05:18.849868"], ["id", 2]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 217], ["LIMIT", 1]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "reserved"], ["updated_at", "2017-10-02 00:05:18.856246"], ["id", 217]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 34]]
---
  def destroy
    car = Car.find_by_id(@order.car_id)
    if !car.nil? #如果车已经删了 就不再改车的状态了 防止报错
      car.update_attribute('status', 'available')
    end

    if @order.reservation_id < Order::CHECKOUT_DIRECT_START_NO
      if !car.nil?
        reservation = Reservation.find(@order.reservation_id)
        reservation.update_attribute('status', 'reserved')
        car.update_attribute('status', 'reserved')
      end
    end
    @order.destroy