app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."email" = ?  [["email", "xiaobb@xx.com"]]
---
  def index
    @orders = Order.all
    if logged_in?
      if current_user.admin?
        @orders = Order.all
      else
        @orders=Order.where(:email => current_user.email)