app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."email" = ?  [["email", "2@2"]]
---
  def index
    @user=User.all
    if logged_in?
      if current_user.admin?
    @reservations = Reservation.all
      else
        @reservations=Reservation.where( :email => current_user.email)