app/controllers/reservations_controller.rb

  def index
    @user=User.all
    if logged_in?
      if current_user.admin?
        @reservations = Reservation.all
      else
        @reservations=Reservation.where(:user_id => current_user.id)
---
SELECT "reservations".* FROM "reservations"
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 10]]

  def new
    @reservation = Reservation.new
    car = Car.find(params[:car_id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @reservation = Reservation.new(reservation_params)
    car = Car.find(@reservation.car_id)
    #change car status to reserved
    @reservation.reserve_time = Time.now
    # period = @reservation.return_time
    @reservation.return_time = @reservation.checkout_time+Integer(reservation_params[:return_time]).hours

    if current_user != nil
      @reservation.user_id = current_user.id
    end
    @reservation.status = 'reserved'
    respond_to do |format|
      if @reservation.save
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "reservations" ("created_at", "updated_at", "name", "address", "email", "status") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2017-09-21 13:53:26.396941"], ["updated_at", "2017-09-21 13:53:26.396941"], ["name", ""], ["address", ""], ["email", ""], ["status", "reserved"]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "reserved"], ["updated_at", "2017-09-21 17:34:02.699428"], ["id", 3]]

  def update
    #added by scc 20170917

    respond_to do |format|
      if @reservation.update(reservation_params)
---
UPDATE "reservations" SET "status" = ?, "name" = ?, "address" = ?, "email" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "reserved"], ["name", "zhangyichi"], ["address", "raleigh"], ["email", "yczhang@gmail.com"], ["updated_at", "2017-09-18 02:52:54.647719"], ["id", 107]]

  def destroy
    #@reservation = current_reservation
    car = Car.find(@reservation.car_id)
    #free the car to available
    car.update_attribute('status', 'available')
    @reservation.destroy
---
SELECT  "cars".* FROM "cars" WHERE "cars"."reservation_id" = ? LIMIT ?  [["reservation_id", 50], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "available"], ["updated_at", "2017-09-21 17:36:05.393053"], ["id", 2]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 2]]