app/controllers/sadminl_controller.rb

SELECT "users".* FROM "users" WHERE "users"."sadmin" = ?  [["sadmin", "t"]]
---
  def index
    @users=User.where( :sadmin => true)