app/controllers/store_controller.rb

  def index
    #index the cars that are available

    @cars = Car.where( :status => 'available')
---
SELECT "cars".* FROM "cars" WHERE "conditions"."status" = ?  [["status", "available"]]