app/controllers/store_controller.rb

SELECT "cars".* FROM "cars" WHERE (location LIKE '%NewYork%' and model LIKE '%%' and manufactor LIKE '%%' and style LIKE '%%' and status LIKE '%%') ORDER BY created_at DESC
SELECT "cars".* FROM "cars" WHERE (style LIKE '%%' and model LIKE '%%') ORDER BY created_at DESC
---
  def index()
    #index the cars that are available

    @cars = Car.where( :status => 'available').order("created_at ASC")

    if params[:search1] or params[:search2]
      @cars = Car.search(params[:search1], params[:search2]).order("created_at DESC")