app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."admin" = ? AND "users"."sadmin" = ?  [["admin", "f"], ["sadmin", "f"]]
---
  def index
    @users=User.where(:admin=>false,:sadmin=>false)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @reservations=Reservation.all
    User.find(params[:id]).destroy