app/views/cars/index.html.erb


      <% if (car.status == 'reserved' and Reservation.find_by(car_id: car.id, status: 'reserved') != nil) %>
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."car_id" = ? AND "reservations"."status" = ? LIMIT ?  [["car_id", 2], ["status", "checkedout"], ["LIMIT", 1]]