app/views/store/index.html.erb

SELECT "cars".* FROM "cars" WHERE (location LIKE '%NewYork%' and model LIKE '%%' and manufactor LIKE '%%' and style LIKE '%%' and status LIKE '%%') ORDER BY created_at DESC
---
<%= form_tag(store_path, :method => "get", id: "search-form") do %>
    <%= 'Location ' %><%= select_tag :search1, options_from_collection_for_select(Car.all.to_a.uniq {|o| o.location}, :location, :location), {:class => 'form-control', :prompt => ''} %>